In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
np.__version__

'1.24.4'

In [4]:
pd.__version__

'2.0.3'

In [24]:
#1
df = pd.DataFrame({'feature': [1,4,2,5,27],'labels': [2,2,4,6,3]})

df

   feature  labels
0        1       2
1        4       2
2        2       4
3        5       6
4       27       3

In [6]:
df=df.rename(columns={'labels':'label'})
df

   feature  label
0        1      2
1        4      2
2        2      4
3        5      6
4       27      3

In [8]:
iris = sns.load_dataset('iris')
iris.sort_values('species', ascending = False)

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

In [10]:
iris.value_counts('species').to_frame('#')

             #
species
setosa      50
versicolor  50
virginica   50

In [12]:
len(iris[(iris.petal_length <= 1.4) | (iris.petal_length >= 1.6)])

137

In [17]:
iris['min_petal'] = iris.apply(lambda my_min: min(my_min.petal_length, my_min.petal_width), axis=1)

In [18]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  min_petal
0           5.1          3.5           1.4          0.2  setosa        0.2
1           4.9          3.0           1.4          0.2  setosa        0.2
2           4.7          3.2           1.3          0.2  setosa        0.2
3           4.6          3.1           1.5          0.2  setosa        0.2
4           5.0          3.6           1.4          0.2  setosa        0.2

In [19]:
iris.tail()

,sepal_length,sepal_width,petal_length,petal_width,species,min_petal
145,6.7,3.0,5.2,2.3,virginica,2.3
146,6.3,2.5,5.0,1.9,virginica,1.9
147,6.5,3.0,5.2,2.0,virginica,2.0
148,6.2,3.4,5.4,2.3,virginica,2.3
149,5.9,3.0,5.1,1.8,virginica,1.8

In [23]:
pd.pivot_table(iris,
               values = ['sepal_width', 'petal_width'],
               columns = ['species'],
               aggfunc = [np.mean, np.median])

              mean                      median
species     setosa versicolor virginica setosa versicolor virginica
petal_width  0.246      1.326     2.026    0.2        1.3       2.0
sepal_width  3.428      2.770     2.974    3.4        2.8       3.0

In [29]:
frame1 = pd.DataFrame({'key': ['scott', 'eric'], "age": [39, 42]})
frame1 = frame1.set_index('key')
frame1

       age
key
scott   39
eric    42

In [31]:
frame2 = pd.DataFrame({'key': ['scott', 'eric', 'laura'], "height": [75, 68, 63]})
frame2 = frame2.set_index('key')
frame2

       height
key
scott      75
eric       68
laura      63